# California Policy Lab Data Analyst Skills Assessment
by Victoria Hollingshead

In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import sklearn

In [2]:
# Import data
link_testa_df = pd.read_csv('/Users/victoriahollingshead/Documents_Secure/CPL_2025/cpl_da_skills_assessment/Link_datasets/Link_testA.csv')
link_testb_df = pd.read_csv('/Users/victoriahollingshead/Documents_Secure/CPL_2025/cpl_da_skills_assessment/Link_datasets/Link_testB.csv')

## Exploratory Data Analysis

In [5]:
# Basic Information for Link Test A
link_testa_df.info()            
display(link_testa_df.head())      
display(link_testa_df.tail())      
display(link_testa_df.sample(5))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2216 entries, 0 to 2215
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  2216 non-null   object
 1   last_name   2216 non-null   object
 2   street_num  2216 non-null   object
 3   address_1   2216 non-null   object
 4   address_2   2216 non-null   object
 5   suburb      2216 non-null   object
 6   postcode    2216 non-null   int64
 7   state       2216 non-null   object
 8   DOB         2216 non-null   object
 9   SSN         2200 non-null   float64
dtypes: float64(1), int64(1), object(8)
memory usage: 173.2+ KB

,first_name,last_name,street_num,address_1,address_2,suburb,postcode,state,DOB,SSN
0,nicholas,clarke,13,gaylard place,tryphinia view,wetherill park,2810,nsw,19041223,3927795.0
1,mya,maksim,41,lambrigg street,brest hill,st kilda,6050,vic,19650630,1488918.0
2,katelyn,campbell,11,ogden close,willandra village,preston,2148,tas,19291114,4043690.0
3,makayla,herbert,5,plummer street,tarwyn park,hopetoun,3925,vic,19111103,1756031.0
4,ben,armiento,17,burnell place,john flynn hospital,fairlight,3630,qld,,8511174.0

,first_name,last_name,street_num,address_1,address_2,suburb,postcode,state,DOB,SSN
2211,samuel,miles,138,hawkesbury crescent,,north ward,2148,sa,,2763477.0
2212,jack,bridgland,170,thermeda place,mirreanda,berkeley vale,2286,nsw,19980721,2930436.0
2213,lucas,portlock,2,mccaw place,greenwood,ascot vale,2680,nsw,19960325,7237519.0
2214,tess,battisson,1,wyola place,malsah,west wollongong,2210,nsw,19230918,3152618.0
2215,amelia,graham-jones,5,mcgivern crescent,australian fair west,new town,2163,act,19000619,5013227.0

,first_name,last_name,street_num,address_1,address_2,suburb,postcode,state,DOB,SSN
627,cassidy,morrison,13,a'beckett street,argyle,ardeer,2518,nsw,19160403,6156712.0
1437,alex,hanna,146,pocket avenue,scottsdale,yangebup,3941,vic,19040515,7193215.0
1573,paris,green,19,zamia place,glendower,frankston,5159,qld,19291117,7101331.0
263,daniel,mcard,34,maccallum circuit,westwood homestead,homebush,2619,nsw,19920927,2550366.0
685,emiily,mees,31,campbell street,lingard,elwood,3805,wa,19301201,4611758.0

In [9]:
# Basic Information for Link Test B
link_testb_df.info()            
display(link_testb_df.head())      
display(link_testb_df.tail())      
display(link_testb_df.sample(5))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2200 entries, 0 to 2199
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   given_name     2200 non-null   object
 1   surname        2200 non-null   object
 2   street_number  2200 non-null   object
 3   address_1      2200 non-null   object
 4   address_2      2200 non-null   object
 5   suburb         2200 non-null   object
 6   postcode       2200 non-null   int64
 7   state          2200 non-null   object
 8   date_of_birth  2200 non-null   object
 9   soc_sec_id     2200 non-null   int64
dtypes: int64(2), object(8)
memory usage: 172.0+ KB

,given_name,surname,street_number,address_1,address_2,suburb,postcode,state,date_of_birth,soc_sec_id
0,phoebe,,33,kumm place,the manor garden,harris park,2323,vic,19061113,3155906
1,angip,wimmre,,baracchi crescent,mawarra herefords,marsden,2406,sa,19700928,3795146
2,blakeston,lock,59,bonnor close,,ment one,7140,wa,19590930,6335558
3,ben,grub,9,girrahween street,loma,brunswick west,1382,nsw,19360711,6198116
4,elle,mattehws,54,maddock place,glenburnie lodge,park orhcards,6058,vic,19960094,9253952

,given_name,surname,street_number,address_1,address_2,suburb,postcode,state,date_of_birth,soc_sec_id
2195,xavier,mogavero,10,epenarra close,ramuda,west wolongong,3148,vic,19121210,2534734
2196,morrison,sophie,11,waller crescent,hmas cerberus,loganlea,3175,vic,19420302,7721195
2197,bailey,stanley,30,colmer street,roclkea,rowew bay,850,nsw,19010804,3200988
2198,caitlin,white,174,collyburlc rescent,,kurwongbah,2456,nsw,19431207,2627787
2199,annabelle,conzens,27,mcluckie crescent,earle haven retirement village,,870,vic,19250508,9397671

,given_name,surname,street_number,address_1,address_2,suburb,postcode,state,date_of_birth,soc_sec_id
1754,emii ly,cobgin,3,knox stteet,,camperdown,2230,wa,19991209,9931751
2051,robert,westhorp,26,kosciusko avenue,oa kp ark,,3109,vic,19690516,1463700
1250,heron,brooke,262,verbrugghens treet,oxley's way,hackham,2560,qld,,7028101
1202,cooper,webb,34,namadgi circuit,fernale,newcastle,2566,nsw,19621205,8131556
368,lachlan,balasubramaniam,26,mackinolty street,balmora lgarden,scarnorough,2388,nsw,19731007,1798069

### Observations

At first glance, it appears there are only 16 null values for SSN Link Test A, but after inspecting the head and tail of each dataset, I can see there are blank lines for various variables. In addition, there are 16 fewer values in the Link Test B dataset than the List Test A dataset. There are also blank lines for various variables. This will require a more thorough review to understand which data cleaning steps may be necessary.

In [ ]:
# Normally, I would divide columns into categorical and numerical values, but because postcode, DOB, and SSN are unique values, I will assess them along with the categorical variables. 
link_testa_df.columns

lista_variables = ['first_name', 'last_name', 'street_num', 'address_1', 'address_2', 'suburb', 'state', 'postcode', 'DOB', 'SSN']

In [13]:
for col in lista_variables:
    print(f"Column: \n {col}")
    print()
    print(f"Unique values: \n {link_testa_df[col].nunique()}")
    print()
    print(f"Value counts: \n {link_testa_df[col].value_counts()}")
    print()
    print(f"Percentage of each unique value: \n{link_testa_df[col].value_counts(normalize=True)}")
    print()
    print(f"Sum of null values: \n{link_testa_df[col].isnull().sum()}" )

Column:
 first_name

Unique values:
 596

Value counts:
              54
 emiily      43
 joshua      35
 jack        32
 lachlan     31
             ..
 zakariah     1
 peta         1
 savannah     1
 iain         1
 billy        1
Name: first_name, Length: 596, dtype: int64

Percentage of each unique value:
             0.024368
 emiily      0.019404
 joshua      0.015794
 jack        0.014440
 lachlan     0.013989
               ...
 zakariah    0.000451
 peta        0.000451
 savannah    0.000451
 iain        0.000451
 billy       0.000451
Name: first_name, Length: 596, dtype: float64

Sum of null values:
0
Column:
 last_name

Unique values:
 1057

Value counts:
  white           61
 clarke          55
 green           42
 webb            40
 reid            37
                 ..
 kincaid          1
 gigney           1
 moolenaar        1
 zoanetti         1
 graham-jones     1
Name: last_name, Length: 1057, dtype: int64

Percentage of each unique value:
 white           0.027527
 clarke          0.024819
 green           0.018953
 webb            0.018051
 reid            0.016697
                   ...
 kincaid         0.000451
 gigney          0.000451
 moolenaar       0.000451
 zoanetti        0.000451
 graham-jones    0.000451
Name: last_name, Length: 1057, dtype: float64

Sum of null values:
0
Column:
 street_num

Unique values:
 311

Value counts:
 1      76
       72
5      70
6      66
2      61
       ..
145     1
242     1
528     1
111     1
142     1
Name: street_num, Length: 311, dtype: int64

Percentage of each unique value:
1      0.034296
       0.032491
5      0.031588
6      0.029783
2      0.027527
         ...
145    0.000451
242    0.000451
528    0.000451
111    0.000451
142    0.000451
Name: street_num, Length: 311, dtype: float64

Sum of null values:
0
Column:
 address_1

Unique values:
 1486

Value counts:
                       50
 forbes street        11
 totterdell street    10
 badimara street       8
 duffy street          6
                      ..
 mcalpine place        1
 hosking place         1
 fitzalan street       1
 willyama place        1
 wyola place           1
Name: address_1, Length: 1486, dtype: int64

Percentage of each unique value:
                      0.022563
 forbes street        0.004964
 totterdell street    0.004513
 badimara street      0.003610
 duffy street         0.002708
                        ...
 mcalpine place       0.000451
 hosking place        0.000451
 fitzalan street      0.000451
 willyama place       0.000451
 wyola place          0.000451
Name: address_1, Length: 1486, dtype: float64

Sum of null values:
0
Column:
 address_2

Unique values:
 1476

Value counts:
                           190
 rowethorpe                20
 brentwood vlge            17
 rosetta village           16
 the willows               11
                         ...
 public school reserve      1
 moreton                    1
 old airdmillan road        1
 station homestead          1
 australian fair west       1
Name: address_2, Length: 1476, dtype: int64

Percentage of each unique value:
                          0.085740
 rowethorpe               0.009025
 brentwood vlge           0.007671
 rosetta village          0.007220
 the willows              0.004964
                            ...
 public school reserve    0.000451
 moreton                  0.000451
 old airdmillan road      0.000451
 station homestead        0.000451
 australian fair west     0.000451
Name: address_2, Length: 1476, dtype: float64

Sum of null values:
0
Column:
 suburb

Unique values:
 1108

Value counts:
  toowoomba          21
                    20
 frankston          16
 belmont            12
 port macquarie     12
                    ..
 farrer              1
 lawson              1
 wentworth falls     1
 deagon              1
 bundamba            1
Name: suburb, Length: 1108, dtype: int64

Percentage of each unique value:
 toowoomba          0.009477
                    0.009025
 frankston          0.007220
 belmont            0.005415
 port macquarie     0.005415
                      ...
 farrer             0.000451
 lawson             0.000451
 wentworth falls    0.000451
 deagon             0.000451
 bundamba           0.000451
Name: suburb, Length: 1108, dtype: float64

Sum of null values:
0
Column:
 state

Unique values:
 9

Value counts:
  nsw    746
 vic    537
 qld    413
 wa     239
 sa     153
 tas     58
 act     32
         23
 nt      15
Name: state, dtype: int64

Percentage of each unique value:
 nsw    0.336643
 vic    0.242329
 qld    0.186372
 wa     0.107852
 sa     0.069043
 tas    0.026173
 act    0.014440
        0.010379
 nt     0.006769
Name: state, dtype: float64

Sum of null values:
0
Column:
 postcode

Unique values:
 1029

Value counts:
 4740    15
4670    12
4214     9
2229     9
2540     9
        ..
2105     1
4730     1
2784     1
5171     1
2163     1
Name: postcode, Length: 1029, dtype: int64

Percentage of each unique value:
4740    0.006769
4670    0.005415
4214    0.004061
2229    0.004061
2540    0.004061
          ...
2105    0.000451
4730    0.000451
2784    0.000451
5171    0.000451
2163    0.000451
Name: postcode, Length: 1029, dtype: float64

Sum of null values:
0
Column:
 DOB

Unique values:
 2106

Value counts:
             41
19900523     2
19361017     2
19680909     2
19021008     2
            ..
19561029     1
19671009     1
19490204     1
19951020     1
19000619     1
Name: DOB, Length: 2106, dtype: int64

Percentage of each unique value:
            0.018502
19900523    0.000903
19361017    0.000903
19680909    0.000903
19021008    0.000903
              ...
19561029    0.000451
19671009    0.000451
19490204    0.000451
19951020    0.000451
19000619    0.000451
Name: DOB, Length: 2106, dtype: float64

Sum of null values:
0
Column:
 SSN

Unique values:
 2200

Value counts:
 3927795.0    1
4066625.0    1
4857758.0    1
7353997.0    1
1997517.0    1
            ..
2553510.0    1
5930609.0    1
3898794.0    1
1293288.0    1
5013227.0    1
Name: SSN, Length: 2200, dtype: int64

Percentage of each unique value:
3927795.0    0.000455
4066625.0    0.000455
4857758.0    0.000455
7353997.0    0.000455
1997517.0    0.000455
               ...
2553510.0    0.000455
5930609.0    0.000455
3898794.0    0.000455
1293288.0    0.000455
5013227.0    0.000455
Name: SSN, Length: 2200, dtype: float64

Sum of null values:
16

## Data Cleaning

## Linkage Analysis